# <center>CODE PORTFOLIO : Data Wrangling using Pandas</center>

## **INDEX**

### [DATAFRAME MANIPULATION DETAILS](#DATAFRAME-MANIPULATION)
1. append
2. merge
3. join
4. concat

### [PANDAS OPERATIONS DETAILS](#PANDAS-OPERATIONS)
1. unique()  : Array of unique elements
2. nunique() : Number of unique elements
3. value_counts() : number of times a unique value has occurred in the DF column. Similar to count(*) .. group by
4. sum()
5. max()
6. min()
7. std()
8. apply() : To apply any function on each element of the data frame
9. drop('col',axis=1,inplace=False)
10. sort_values(by='col')
11. isnull() : returns a boolean DF having True if the value is NULL
12. pivot_table() : Works similar to the pivot table function of MS Excel. 

### [CONDITIONAL SELECTION OF DATA DETAILS](#CONDITIONAL-SELECTION-OF-DATA)
1. | is OR
2. & is AND

In [1]:
## Importing pandas library used for data frame operations and analysis
import pandas as pd

### DATAFRAME MANIPULATION

Reference : https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [2]:
## Sample dataframe creation 

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df9 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['X4', 'X5', 'X6', 'X7'],
                        'C': ['Y4', 'Y5', 'Y6', 'Y7'],
                        'D': ['Z4', 'Z5', 'Z6', 'Z7']},
                         index=[0, 1, 2, 3])

In [3]:
## Using append method on a dataframe 
df1.append(df2)

## Note : can be used with multiple DFs:
## result = df1.append([df2, df3])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [4]:
## creating df3 by resetting index of df2
df3 = df2.reset_index()         # adds index as a sequence starting from 0
df3.drop('index', axis=1, inplace=True)   ## reset_index retains the original index column, dropping it using drop() method

In [5]:
# Using merge on a selected column
# on = column name
# suffixes = suffixes to be used for common columns
# how = inner by default

pd.merge(df2,df9,on='A',suffixes=('_2','_9'))

    A B_2 C_2 D_2 B_9 C_9 D_9
0  A4  B4  C4  D4  X4  Y4  Z4
1  A5  B5  C5  D5  X5  Y5  Z5
2  A6  B6  C6  D6  X6  Y6  Z6
3  A7  B7  C7  D7  X7  Y7  Z7

In [6]:
# Using merge with how = 'outer'

pd.merge(df1,df3,how='outer')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
# Using join method on dataframes
# join works on the index of DFs
# lsuffix, rsuffix = to add suffices to common columns
# how is 'inner' by default

df1.join(df3,lsuffix='_l')

  A_l B_l C_l D_l   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7

In [8]:
# Using concat to combine two or more dataframes
# accepts list pf DFs
# axis = 0 is default

pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [9]:
# Using concat to combine two or more dataframes with axis=1

pd.concat([df1,df2], axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

### PANDAS OPERATIONS

Reference : Various online tutorials

In [10]:
# unique()
# To fetch unique value of a DF column

print(df1['B'].unique())

['B0' 'B1' 'B2' 'B3']

In [11]:
# nunique()
# To find out number of unique elements of a DF column

print(df1['B'].nunique())

4

In [12]:
# value_counts()
# It is similar to sql `select value, count(1) from table group by value`

print(df1['A'].value_counts())

A0    1
A3    1
A1    1
A2    1
Name: A, dtype: int64

In [13]:
# Creation of a dummy dataframe
df_amounts = pd.DataFrame({'Person': ['P0', 'P1', 'P2', 'P3'],
                        'Sal': [100, 120, 140, 160]},
                        index=[0, 1, 2, 3])

In [14]:
print("Sum of 'sal' attribute of df_amounts : ", df_amounts['Sal'].sum())
print("Max of 'sal' attribute of df_amounts : ", df_amounts['Sal'].max())
print("min of 'sal' attribute of df_amounts : ", df_amounts['Sal'].min())
print("std of 'sal' attribute of df_amounts : ", df_amounts['Sal'].std())

Sum of 'sal' attribute of df_amounts :  520
Max of 'sal' attribute of df_amounts :  160
min of 'sal' attribute of df_amounts :  100
std of 'sal' attribute of df_amounts :  25.81988897471611

In [15]:
# Sorting DF based on a particular column
df_amounts.sort_values(by='Sal', ascending=False)

  Person  Sal
3     P3  160
2     P2  140
1     P1  120
0     P0  100

In [16]:
# Using apply method to apply a function on each value of a DF attribute
# applying following function increment or the lambda function has same effect on the data

# def increment(x):
#     return x*1.1

df_amounts['Sal'] = df_amounts['Sal'].apply(lambda x :x*1.1)
print(df_amounts)

  Person    Sal
0     P0  110.0
1     P1  132.0
2     P2  154.0
3     P3  176.0

In [17]:
# isnull() return True/False if a cell contains NaN/null value

pd.concat([df1,df2], axis=1).isnull()

       A      B      C      D      A      B      C      D
0  False  False  False  False   True   True   True   True
1  False  False  False  False   True   True   True   True
2  False  False  False  False   True   True   True   True
3  False  False  False  False   True   True   True   True
4   True   True   True   True  False  False  False  False
5   True   True   True   True  False  False  False  False
6   True   True   True   True  False  False  False  False
7   True   True   True   True  False  False  False  False

In [18]:
# drop() methos to drop a column from the DF

df9.drop('D', axis=1, inplace=False)

    A   B   C
0  A4  X4  Y4
1  A5  X5  Y5
2  A6  X6  Y6
3  A7  X7  Y7

In [19]:
df_amounts['Flag']=[1,1,2,2]
df_amounts

  Person    Sal  Flag
0     P0  110.0     1
1     P1  132.0     1
2     P2  154.0     2
3     P3  176.0     2

In [20]:
# Use of pivot table to get sum of 'Sal' for each value of 'Flag' 

pd.pivot_table(df_amounts,values='Sal', columns='Flag', aggfunc=sum)

Flag      1      2
Sal   242.0  330.0

### CONDITIONAL SELECTION OF DATA

In [21]:
# Selecting DF based of a value of 'Person' column
df_amounts[df_amounts['Person'] == 'P1']

  Person    Sal  Flag
1     P1  132.0     1

In [22]:
# Using or "|" operator to select data from DF
df_amounts[(df_amounts['Person'] == 'P1') | (df_amounts['Flag'] == 1)]

  Person    Sal  Flag
0     P0  110.0     1
1     P1  132.0     1

In [23]:
# Using and "&" operator to select data from DF
df_amounts[(df_amounts['Sal'] > 150) & (df_amounts['Flag'] == 2)]

  Person    Sal  Flag
2     P2  154.0     2
3     P3  176.0     2